/*
 * `kj.h`
 *
 * ---------------------------------- LICENSE ----------------------------------
 * This software is in the public domain.  Where that dedication is not
 * recognized, you are granted a perpetual, irrevocable license to copy,
 * distribute, and modify the source code as you see fit.
 *
 * The source code is provided "as is", without warranty of any kind, express
 * or implied. No attribution is required, but always appreciated.
 * =============================================================================
 *
 * usage:
 *      #define KJ_IMPL
 *     #include "kj.h"
 */

#ifndef KJ_H
#define KJ_H

#define KJ_VERSION_MAJOR 0
#define KJ_VERSION_MINOR 11
#define KJ_VERSION_PATCH 0

#if defined(__cplusplus)
#define KJ_EXTERN_BEGIN extern "C" {
#define KJ_EXTERN_END }
#else
#define KJ_EXTERN_BEGIN
#define KJ_EXTERN_END
#endif

KJ_EXTERN_BEGIN

#if defined(__x86_64__) || defined(_M_X64) || defined(__amd64__)
#define KJ_ARCH_64_BIT
#define KJ_ARCH_X86
#define KJ_ARCH_NAME "x86_64"
#elif defined(__i386__) || defined(_M_IX86) || defined(_X86_)
#define KJ_ARCH_32_BIT
#define KJ_ARCH_X86
#define KJ_ARCH_NAME "x86"
#elif defined(__aarch64__)
#define KJ_ARCH_64_BIT
#define KJ_ARCH_ARM
#define KJ_ARCH_NAME "arm64"
#elif defined(__arm__) || defined(_M_ARM)
#define KJ_ARCH_32_BIT
#define KJ_ARCH_ARM
#define KJ_ARCH_NAME "arm"
#elif defined(__mips__)
#define KJ_ARCH_32_BIT
#define KJ_ARCH_MIPS
#define KJ_ARCH_NAME "mips"
#else
#error "Unsupported Architecture"
#endif


#if __STDC_VERSION__ >= 201112L
#define KJ_C11
#endif
#if __STDC_VERSION__ >= 199901L
#define KJ_C99
#endif
#endif

enum {
    KJ_ASCII_MAX = 0x7F,
    KJ_LATIN1_MAX = 0xFF,
    KJ_UNICODE_MAX = 0x10FFFF,
    KJ_UNICODE_REPLACEMENT = 0xFFFD,
    KJ_PATH_MAX = 4096,
    KJ_NAME_MAX = 255,
#if defined(KJ_SYS_WIN32)
    KJ_PATH_SEPARATOR = '\\'
#elif defined(KJ_SYS_UNIX)
    KJ_PATH_SEPARATOR = '/'
#endif
};

#if defined(KJ_SYS_WIN32)
#define KJ_PATH_SEPARATOR_STR "\\"
#elif defined(KJ_SYS_UNIX)
#define KJ_PATH_SEPARATOR_STR "/"
#endif

#define KJ_LE 1234
#define KJ_BE 4321

#if defined(KJ_SYS_UNIX)
#if __BYTE_ORDER == __BIG_ENDIAN
#define KJ_ENDIAN KJ_BE
#elif __BYTE_ORDER == __LITTLE_ENDIAN
#define KJ_ENDIAN KJ_LE
#else
#error "Unsupported Endianness"
#endif
#elif defined(KJ_SYS_WIN32)
#define KJ_ENDIAN KJ_LE
#else
#error "Unsupported Endianness"
#endif

#if !defined(NULL)
#if defined(KJ_COMPILER_MSVC)
#define NULL 0
#elif defined(KJ_COMPILER_GNU)
#define NULL __null
#else
#define NULL (kj_cast(void*, 0))
#endif
#endif

#if !defined(KJ_API)
#if defined(KJ_STATIC)
#define KJ_API static
#else
#define KJ_API extern
#endif
#endif

#if !defined(KJ_EXTERN)
#if defined(KJ_COMPILER_MSVC)
#if defined(KJ_CPP)
#define KJ_EXTERN extern "C" __declspec(dllexport)
#else
#define KJ_EXTERN __declspec(dllexport)
#endif
#elif defined(KJ_COMPILER_GNU) || defined(KJ_COMPILER_CLANG)
#if defined(KJ_CPP)
#define KJ_EXTERN extern "C"
#else
#define KJ_EXTERN
#endif
#endif
#endif

#if !defined(restrict)
#if defined(KJ_COMPILER_MSVC) && !defined(KJ_CPP) && _MSC_VER <= 1800
#define restrict __restrict
#endif
#endif

#if !defined(KJ_INLINE)
#if defined(KJ_COMPILER_MSVC)
#define KJ_INLINE __forceinline
#elif defined(KJ_COMPILER_GNU) || defined(KJ_COMPILER_CLANG)
#if defined(KJ_C99)
#define KJ_INLINE __attribute__((always_inline)) inline
#else
#define KJ_INLINE
#endif
#endif
#endif

#if !defined(KJ_NO_INLINE)
#if defined(KJ_COMPILER_MSVC)
#define KJ_NO_INLINE __declspec(noinline)
#elif defined(KJ_COMPILER_GNU) || defined(KJ_COMPILER_CLANG)
#define KJ_NO_INLINE __attribute__((noinline))
#endif
#endif

#if !defined(KJ_CONST)
#if defined(KJ_COMPILER_MSVC)
#define KJ_CONST
#elif defined(KJ_COMPILER_GNU) || defined(KJ_COMPILER_CLANG)
#define KJ_CONST __attribute__((const))
#endif
#endif

#if !defined(KJ_GLOBAL)
#define KJ_GLOBAL static
#endif

#if !defined(KJ_INTERN)
#define KJ_INTERN static
#endif

/* Utility Macros */

#if !defined(elif)
#define elif else if
#endif

#if !defined(loop)
#define loop for(;;)
#endif

#if !defined(kj_cast)
#define kj_cast(t, e) ((t) (e))
#define KJ_CAST(t, e) ((t) (e))
#endif

#if !defined(kj_isize_of)
#define kj_isize_of(a) (kj_cast(isize, sizeof(a)))
#define kj_usize_of(a) (kj_cast(usize, sizeof(a)))
#endif

#if !defined(kj_count_of)
#define kj_count_of(a) (kj_isize_of(a) / kj_isize_of((a)[0]))
#endif

#if !defined(kj_offset_of)
#define kj_offset_of(s, m) (kj_cast(isize, (&(kj_cast(s*, 0)->m))))
#endif

#if !defined(kj_align_of)
#define kj_align_of(type) (kj_offset_of(struct { u8 c; type member; }, member))
#endif

#if !defined(kj_align_on)
#define kj_align_on(p, a)                                                       \
    kj_cast(void*, (kj_cast(uptr, p) + ((a) - 1)) & ~((a) - 1))
#endif

#if !defined(kj_concat)
#define KJ_JOIN(a, b) KJ_JOIN1(a, b)
#define KJ_JOIN1(a, b) KJ_JOIN2(a, b)
#define KJ_JOIN2(a, b) a##b
#endif

#if !defined(kj_unused)
#define kj_unused(a) kj_cast(void, (a))
#endif

#if !defined(kj_min)
#define kj_min(a, b) ((a) < (b) ? (a): (b))
#define kj_max(a, b) ((a) > (b) ? (a): (b))
#define kj_clamp(a, min, max) (kj_max((min), kj_min((a), (max))))
#define kj_wrap(a, min, max) ((a) > (max) ? (min): (a) < (min) ? (max): (a))
#define kj_lerp(t, min, max) ((1.0f - (t)) * (min) + (t) * (max))
#define kj_range(a, fmin, fmax, tmin, tmax)                                     \
    (((a) - (fmin)) * ((tmax) - (tmin)) / (((fmax) - (fmin)) + (tmin)))
#define kj_swap(T, a, b)                                                        \
    do { T tmp_##__LINE__ = a; a = b; b = tmp_##__LINE__; } while(0)
#define kj_abs(a) ((a) > 0 ? (a): -(a))
#define kj_sign(a) ((a) >= 0 ? 1: -1)
#define kj_round_to(a, b) ((a) + (((b) - 1) - (((a) - 1) % (b))))
#endif

#if !defined(kj_kb_to_b)
#define kj_kb_to_b(a) ((a) * 1024)
#define kj_mb_to_b(a) (kj_kb_to_b((a)) * 1024)
#define kj_gb_to_b(a) (kj_mb_to_b((a)) * 1024)
#define kj_tb_to_b(a) (kj_gb_to_b((a)) * 1024)
#define kj_b_to_kb(a) ((a) / 1024)
#define kj_b_to_mb(a) (kj_b_to_kb((a)) / 1024)
#define kj_b_to_gb(a) (kj_b_to_mb((a)) / 1024)
#define kj_b_to_tb(a) (kj_b_to_gb((a)) / 1024)
#endif

#if !defined(KJ_FLAG)
#define KJ_FLAG(a) (0x01 << (a))
#define KJ_FLAG_NONE (0)
#define KJ_FLAG_ALL (I32_MAX)
#endif

#if !defined(kj_copy)
#if defined(KJ_SYS_WIN32)
#define kj_copy CopyMemory
#define kj_set FillMemory
#define kj_zero ZeroMemory
#define kj_move MoveMemory
#elif defined(KJ_COMPILER_GNU) || defined(KJ_COMPILER_CLANG)
#define kj_copy __builtin_memcpy
#define kj_set(p, s, v) __builtin_memset((p), (v), (s))
#define kj_zero(p, s) kj_set(p, s, 0)
#define kj_move __builtin_memmove
#endif

#define kj_one(p, s) kj_set(p, s, 1)
#define kj_fill(p, s) kj_set(p, s, 0xFF)
#endif

#if defined(KJ_C11)
#define KJ_STATIC_ASSERT(expr) _Static_assert(expr, kj_str_of(expr))
#else
#define KJ_STATIC_ASSERT(expr)                                                  \
    typedef void* KJ_JOIN(KJ_STATIC_ASSERT_, __LINE__)[(expr) * 2 - 1]
#endif

/* Types */

#if defined(KJ_C99)
#include <stdint.h>
typedef int8_t i8;
typedef uint8_t u8;
typedef int16_t i16;
typedef uint16_t u16;
typedef int32_t i32;
typedef uint32_t u32;
typedef int64_t i64;
typedef uint64_t u64;
#elif defined(KJ_COMPILER_MSVC)
typedef signed __int8 i8;
typedef unsigned __int8 u8;
typedef signed __int16 i16;
typedef unsigned __int16 u16;
typedef signed __int32 i32;
typedef unsigned __int32 u32;
typedef signed __int64 i64;
typedef unsigned __int64 u64;
#else
typedef signed char i8;
typedef unsigned char u8;
typedef signed short i16;
typedef unsigned short u16;
typedef signed int i32;
typedef unsigned int u32;
typedef signed long i64;
typedef unsigned long u64;
#endif

#if !defined(KJ_I8_MIN)
#define I8_MIN (-128)
#define I8_MAX (127)
#define I16_MIN (-32768)
#define I16_MAX (32767)
#define I32_MIN (-2147483648)
#define I32_MAX (2147483647)
#define I64_MIN (-9223372036854775808)
#define I64_MAX (9223372036854775807)

#define U8_MIN (0x00)
#define U8_MAX (0xFF)
#define U16_MIN (0x0000)
#define U16_MAX (0xFFFF)
#define U32_MIN (0x00000000)
#define U32_MAX (0xFFFFFFFF)
#define U64_MIN (0x0000000000000000)
#define U64_MAX (0xFFFFFFFFFFFFFFFF)
#endif

typedef i8 b8;
typedef i32 b32;

#if defined(KJ_ARCH_64_BIT)
typedef i64 isize;
typedef u64 usize;
#elif defined(KJ_ARCH_32_BIT)
typedef i32 isize;
typedef u32 usize;
#endif

KJ_STATIC_ASSERT(sizeof(void*) == sizeof(isize));
KJ_STATIC_ASSERT(sizeof(void*) == sizeof(usize));

#if !defined(ISIZE_MIN)
#if defined(ARCH_64_BIT)
#define ISIZE_MIN I64_MIN
#define ISIZE_MAX I64_MAX

#define USIZE_MIN U64_MIN
#define USIZE_MAX U64_MAX
#elif defined(ARCH_32_BIT)
#define ISIZE_MIN I32_MIN
#define ISIZE_MAX I32_MAX

#define USIZE_MIN U32_MIN
#define USIZE_MAX U32_MAX
#endif
#endif

typedef isize iptr;
typedef usize uptr;
typedef isize dptr;

typedef float f32;
typedef double f64;

#if !defined(F32_MIN)
#define F32_MIN (-3.402823e+38f)
#define F32_MAX (3.402823e+38f)
#define F32_EPS (1.192093e-07f)

#define F64_MIN (-1.797693e+308)
#define F64_MAX (1.797693e+308)
#define F64_EPS (2.220446e-16)
#endif

KJ_STATIC_ASSERT(sizeof(i8) == 1);
KJ_STATIC_ASSERT(sizeof(u8) == 1);
KJ_STATIC_ASSERT(sizeof(i16) == 2);
KJ_STATIC_ASSERT(sizeof(u16) == 2);
KJ_STATIC_ASSERT(sizeof(i32) == 4);
KJ_STATIC_ASSERT(sizeof(u32) == 4);
KJ_STATIC_ASSERT(sizeof(i64) == 8);
KJ_STATIC_ASSERT(sizeof(u64) == 8);
KJ_STATIC_ASSERT(sizeof(f32) == 4);
KJ_STATIC_ASSERT(sizeof(f64) == 8);

#define KJ_TYPE_MAP(X)                                                          \
    X(KJ_TYPE_CHAR, "char", char)                                               \
    X(KJ_TYPE_I8, "i8", i8)                                                     \
    X(KJ_TYPE_U8, "u8", u8)                                                     \
    X(KJ_TYPE_I16, "i16", i16)                                                  \
    X(KJ_TYPE_U16, "u16", u16)                                                  \
    X(KJ_TYPE_I32, "i32", i32)                                                  \
    X(KJ_TYPE_U32, "u32", u32)                                                  \
    X(KJ_TYPE_I64, "i64", i64)                                                  \
    X(KJ_TYPE_U64, "u64", u64)                                                  \
    X(KJ_TYPE_ISIZE, "isize", isize)                                            \
